LJD12138/HS800/APP/.pack/GigaDevice/GD32F50x_DFP.1.0.1/GigaDevice.GD32F50x_DFP.pdsc
<?xml version="1.0" encoding="UTF-8"?>
<package schemaVersion="1.1" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
  <vendor>GigaDevice</vendor>
  <url>https://gd32mcu.com/data/documents/pack/</url>
  <name>GD32F50x_DFP</name>
  <description>GigaDevice GD32F50x Series Device Support and Examples</description>
  <releases>
   <release version="1.0.1" date="2025-11-14">
    Update F503/F502 selection and IAR JTAG =true fix SVD error
   </release>
   <release version="1.0.0" date="2025-10-31">
    Update SVD and fix warnings
   </release>
   <release version="0.0.5" date="2025-10-23">
    Remove three models GD32F505CCT6/RCT6/VCT6 and modify clock frequency
   </release>
   <release version="0.0.4" date="2025-10-14">
    Add F502 selection and modify clock frequency
   </release>
   <release version="0.0.3" date="2025-07-14">
    change flash loader.chip select
   </release>
   <release version="0.0.2" date="2025-06-11">
    change flash loader.
   </release>
   <release version="0.0.0" date="2025-04-18">
    First Release version of GD32F50x Device Family Pack.
   </release>
  </releases>
  <keywords>
  <!-- keywords for indexing -->
  <keyword>GigaDevice</keyword>
  <keyword>Device Support</keyword>
  <keyword>GD32F50x</keyword>
  </keywords>
  <devices>
    <family Dfamily="GD32F50x Series" Dvendor="GigaDevice:123">
      <processor Dcore="Cortex-M33" DcoreVersion="r2p1" Ddsp="DSP" Dfpu="1" Dmpu="1" Dendian="Little-endian"/>
      <description>
GD32 is a new 32-bit high performance, low power consumption universal micro controller family powered by the ARM Cortex-M33 RISC core,which targeted at various MCU application areas.
GD32 family integrates features to simplify system design and provide customers wide range of comprehensive and superior cost effective MCU portfolios with proven technology and great innovation.
GD32 family includes entry line, performance line and connectivity line currently.
      </description>
      <feature type="XTAL"               n="4000000"       m="32000000"  			  name="Crystal Oscillator"/>
      <feature type="CoreOther"       	 n="1"                                        name="CRC Calculation Unit"/>
      <feature type="DMA"                n="12"                                       name="General Purpose DMA"/>
      <feature type="IntRC"              n="8000000"                           	  	  name="Internal 8M RC oscillator"/>
      <feature type="IntRC"              n="48000000"                           	  name="Internal 48M RC oscillator"/>
      <feature type="RTC"                n="40000"                                 	  name="RTC with 40 kHz calibrated Oscillator and Battery Backup"/>
      <feature type="PLL"                n="3"                                        name="Internal PLL"/>
      <feature type="PowerMode"    		 n="4"                                        name="Run, Sleep, Deep-Sleep, Standby"/>
      <feature type="PowerOther"         n="4"                                        name="POR, PDR, LVD, and BPOR"/>
      <feature type="ExtInt"             n="20"                                       name="External interrupt"/>
      <feature type="Temp"               n="-40"            m="85"                	  name="Extended Operating Temperature Range"/>
      <feature type="ADC"                n="3"              m="25"                	  name="High-Performance ADC"/>
      <feature type="DAC"                n="1"              m="12"                	  name="Digital-to-analog converter"/>
      <feature type="TempSens"           n="1"                                        name="Temperature sensor"/>
      <feature type="Timer"              n="5"              m="16"                	  name="16-bit General Purpose Timer"/>
      <feature type="Timer"              n="2"              m="16"                    name="Advanced Timer"/>
      <feature type="Timer"              n="2"              m="16"                    name="Basic Timer"/>
      <feature type="Timer"              n="1"              m="24"                    name="SysTick Timer"/>
      <feature type="WDT"                n="2"                                        name="Watchdog timer"/>
      <feature type="MPSerial"           n="4"                                        name="Multi-Purpose Serial Interface Module: I2C, I2S, SPI, USART"/>
      <feature type="USART"              n="3"              m="7500000"    		  	  name="High-Speed USART Interface"/>
      <feature type="UART"               n="2"              m="7500000"    		  	  name="High-Speed UART Interface"/>
      <feature type="CAN"                n="2"                                        name="CAN 2.0b Controller"/>
      <feature type="USBOTG"             n="1"                                        name="High-Speed/Full-Speed USB OTG with PHY"/>
      <feature type="IOs"                n="80"                                       name="IO pins"/>
      <feature type="I2C"                n="2"                                        name="Low-Power I2C"/>
      <feature type="SPI"                n="3"                                        name="SPI Interface"/>
      <feature type="I2S"                n="2"                                        name="I2S Interface"  />
      <feature type="VCC"                n="2.6"            m="3.6"          		  name="Voltage"/>
      <feature type="NVIC"               n="79"                                       name="NVIC"/>

<!-- ************************  Subfamily 'GD32F502'  **************************** -->
      <subFamily DsubFamily="GD32F502">
        <processor Dclock="200000000"/>
        <debug svd="SVD/GD32F50x.svd"/>
        <description>
        GD32F503 - ARM Cortex-M33 Core
          Frequency up to 200 MHz
          Flash access zero wait state
          Single-cycle multiplier and hardware divider

        Memories
          Flash size from 128 KB to 1024 KB
          SRAM size from 64KB to 128KB 
        </description>
        
        <!-- *************************  Device 'GD32F502CB'  ***************************** -->
        <device Dname="GD32F502CB">
          <memory    id="IROM1"                   start="0x08000000" size="0x020000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x10000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x020000" default="1"/>
          <debug svd="SVD/GD32F50x.svd"/>
        </device>
        <!-- *************************  Device 'GD32F502CC'  ***************************** -->
        <device Dname="GD32F502CC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x10000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x040000" default="1"/>
          <debug svd="SVD/GD32F50x.svd"/>
        </device>

        <!-- *************************  Device 'GD32F502CE'  ***************************** -->
        <device Dname="GD32F502CE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x010000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x080000" default="1"/>
          <debug svd="SVD/GD32F50x.svd"/>
        </device>

        <!-- *************************  Device 'GD32F502CG'  ***************************** -->
        <device Dname="GD32F502CG">
          <memory    id="IROM1"                   start="0x08000000" size="0x0100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x0100000" default="1"/>
          <debug svd="SVD/GD32F50x.svd"/>
        </device>

        <!-- *************************  Device 'GD32F502RB'  ***************************** -->
        <device Dname="GD32F502RB">
          <memory    id="IROM1"                   start="0x08000000" size="0x020000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x10000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x020000" default="1"/>
          <debug svd="SVD/GD32F50x.svd"/>
        </device>

        <!-- *************************  Device 'GD32F502RC'  ***************************** -->
        <device Dname="GD32F502RC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x10000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x040000" default="1"/>
          <debug svd="SVD/GD32F50x.svd"/>
        </device>

        <!-- *************************  Device 'GD32F502RE'  ***************************** -->
        <device Dname="GD32F502RE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x010000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x080000" default="1"/>
          <debug svd="SVD/GD32F50x.svd"/>
        </device>

        <!-- *************************  Device 'GD32F502RG'  ***************************** -->
        <device Dname="GD32F502RG">
          <memory    id="IROM1"                   start="0x08000000" size="0x0100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x20000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x0100000" default="1"/>
          <debug svd="SVD/GD32F50x.svd"/>
        </device>

        <!-- *************************  Device 'GD32F502VC'  ***************************** -->
        <device Dname="GD32F502VC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x10000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x040000" default="1"/>
          <debug svd="SVD/GD32F50x.svd"/>
        </device>

        <!-- *************************  Device 'GD32F502VE'  ***************************** -->
        <device Dname="GD32F502VE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x010000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x080000" default="1"/>
          <debug svd="SVD/GD32F50x.svd"/>
        </device>

        <!-- *************************  Device 'GD32F502VG'  ***************************** -->
        <device Dname="GD32F502VG">
          <memory    id="IROM1"                   start="0x08000000" size="0x0100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x20000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x0100000" default="1"/>
          <debug svd="SVD/GD32F50x.svd"/>
        </device>

        <!-- *************************  Device 'GD32F502KB'  ***************************** -->
        <device Dname="GD32F502KB">
          <memory    id="IROM1"                   start="0x08000000" size="0x020000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x10000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x020000" default="1"/>
          <debug svd="SVD/GD32F50x.svd"/>
        </device>

