LJD12138/HS800/APP/.pack/GigaDevice/GD32F50x_DFP.1.0.1/GigaDevice.GD32F50x_DFP.pdsc
        <!-- *************************  Device 'GD32F502KC'  ***************************** -->
        <device Dname="GD32F502KC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x10000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x040000" default="1"/>
          <debug svd="SVD/GD32F50x.svd"/>
        </device>

        <!-- *************************  Device 'GD32F502KE'  ***************************** -->
        <device Dname="GD32F502KE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x010000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x080000" default="1"/>
          <debug svd="SVD/GD32F50x.svd"/>
        </device>

      </subFamily>
<!-- ************************  Subfamily 'GD32F503'  **************************** -->
      <subFamily DsubFamily="GD32F503">
        <processor Dclock="252000000"/>
        <description>
        GD32F503 - ARM Cortex-M33 Core
          Frequency up to 252 MHz
          Flash access zero wait state
          Single-cycle multiplier and hardware divider

        Memories
          Flash size from 256 KB to 1024 KB
          SRAM size from 64KB to 128KB 
        </description>

        <!-- *************************  Device 'GD32F503CC'  ***************************** -->
        <device Dname="GD32F503CC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x10000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x040000" default="1"/>
          <debug svd="SVD/GD32F50x.svd"/>
        </device>

        <!-- *************************  Device 'GD32F503CE'  ***************************** -->
        <device Dname="GD32F503CE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x010000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x080000" default="1"/>
          <debug svd="SVD/GD32F50x.svd"/>
        </device>

        <!-- *************************  Device 'GD32F503CG'  ***************************** -->
        <device Dname="GD32F503CG">
          <memory    id="IROM1"                   start="0x08000000" size="0x0100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x0100000" default="1"/>
          <debug svd="SVD/GD32F50x.svd"/>
        </device>

        <!-- *************************  Device 'GD32F503RC'  ***************************** -->
        <device Dname="GD32F503RC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x10000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x040000" default="1"/>
          <debug svd="SVD/GD32F50x.svd"/>
        </device>

        <!-- *************************  Device 'GD32F503RE'  ***************************** -->
        <device Dname="GD32F503RE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x010000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x080000" default="1"/>
          <debug svd="SVD/GD32F50x.svd"/>
        </device>

        <!-- *************************  Device 'GD32F503RG'  ***************************** -->
        <device Dname="GD32F503RG">
          <memory    id="IROM1"                   start="0x08000000" size="0x0100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x20000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x0100000" default="1"/>
          <debug svd="SVD/GD32F50x.svd"/>
        </device>

        <!-- *************************  Device 'GD32F503VC'  ***************************** -->
        <device Dname="GD32F503VC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x10000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x040000" default="1"/>
          <debug svd="SVD/GD32F50x.svd"/>
        </device>

        <!-- *************************  Device 'GD32F503VE'  ***************************** -->
        <device Dname="GD32F503VE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x010000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x080000" default="1"/>
          <debug svd="SVD/GD32F50x.svd"/>
        </device>

        <!-- *************************  Device 'GD32F503VG'  ***************************** -->
        <device Dname="GD32F503VG">
          <memory    id="IROM1"                   start="0x08000000" size="0x0100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x20000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x0100000" default="1"/>
          <debug svd="SVD/GD32F50x.svd"/>
        </device>

        <!-- *************************  Device 'GD32F503KC'  ***************************** -->
        <device Dname="GD32F503KC">
          <memory    id="IROM1"                   start="0x08000000" size="0x040000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x10000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x040000" default="1"/>
          <debug svd="SVD/GD32F50x.svd"/>
        </device>

        <!-- *************************  Device 'GD32F503KE'  ***************************** -->
        <device Dname="GD32F503KE">
          <memory    id="IROM1"                   start="0x08000000" size="0x080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x010000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x080000" default="1"/>
          <debug svd="SVD/GD32F50x.svd"/>
        </device>

      </subFamily>

