LJD12138/HS800/APP/.pack/GigaDevice/GD32F50x_DFP.1.0.1/GigaDevice.GD32F50x_DFP.pdsc
<!-- ************************  Subfamily 'GD32F505'  **************************** -->
      <subFamily DsubFamily="GD32F505">
        <processor Dclock="252000000"/>
        <debug svd="SVD/GD32F50x.svd"/>
        <description>
        GD32F505 - ARM Cortex-M33 Core
          Frequency up to 280 MHz
          Flash access zero wait state
          Single-cycle multiplier and hardware divider

        Memories
          Flash size from 512 KB to 1024 KB
          SRAM size from 128KB to 192KB with HW parity checking
          18 KB ISP loader ROM
        </description>

        <!-- *************************  Device 'GD32F505RE  ***************************** -->
        <device Dname="GD32F505RE">
          <memory    id="IROM1"                   start="0x08000000" size="0x0080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x0100000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F505RG  ***************************** -->
        <device Dname="GD32F505RG">
          <memory    id="IROM1"                   start="0x08000000" size="0x0100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x030000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x0100000" default="1"/>
        </device>


        <!-- *************************  Device 'GD32F505VE  ***************************** -->
        <device Dname="GD32F505VE">
          <memory    id="IROM1"                   start="0x08000000" size="0x0080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x0100000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F505VG  ***************************** -->
        <device Dname="GD32F505VG">
          <memory    id="IROM1"                   start="0x08000000" size="0x0100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x030000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x0100000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F505CE  ***************************** -->
        <device Dname="GD32F505CE">
          <memory    id="IROM1"                   start="0x08000000" size="0x0080000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x020000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x0100000" default="1"/>
        </device>

        <!-- *************************  Device 'GD32F505CG  ***************************** -->
        <device Dname="GD32F505CG">
          <memory    id="IROM1"                   start="0x08000000" size="0x0100000" startup="1" default="1"/>
          <memory    id="IRAM1"                   start="0x20000000" size="0x030000" init   ="0" default="1"/>
          <algorithm name="Flash/GD32F50x.FLM" start="0x08000000" size="0x0100000" default="1"/>
        </device>
      </subFamily>

    </family>
  </devices>

  <conditions>
    <!-- Compiler Conditions -->
    <condition id="Compiler ARMCC">
      <require Tcompiler="ARMCC"/>
    </condition>


    <!-- Device Conditions -->
    <condition id="GD32F50x">
      <description>GigaDevice GD32F50x Devices</description>
      <require Dvendor="GigaDevice:123" Dname="GD32F50[235]*"/>
      <require Cclass="Device" Cgroup="Startup" />
    </condition>

    <!-- Device + CMSIS Conditions -->
    <condition id="GD32F50x CMSIS">
      <description>GigaDevice GD32F50x Devices and CMSIS-CORE</description>
      <accept condition="GD32F50x" />
      <require Cclass="CMSIS" Cgroup="CORE" />
      <require Cclass="Device" Cgroup="GD32F50x_libopt" />
      <require Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="RCU" />
      <require Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="PMU" />
    </condition>

    <!-- GD32F50x STDPERIPHERALS RCU Conditions -->
    <condition id="GD32F50x STDPERIPHERALS RCU">
      <description>GigaDevice GD32F50x Standard Peripherals Drivers with RCU</description>
      <require condition="GD32F50x CMSIS" />
      <require Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="RCU" />
    </condition>

    <!-- GD32F50x STDPERIPHERALS MISC Conditions -->
    <condition id="GD32F50x STDPERIPHERALS MISC">
      <description>GigaDevice GD32F50x Standard Peripherals Drivers with MISC</description>
      <require condition="GD32F50x CMSIS" />
      <require Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="MISC" />
    </condition>

    <!-- GD32F50x STDPERIPHERALS EVAL Conditions -->
    <condition id="GD32F50x STDPERIPHERALS EVAL">
      <description>GigaDevice GD32F50x Standard Peripherals Drivers with EVAL</description>
      <require condition="GD32F50x CMSIS" />
      <require Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="GPIO" />
      <require Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="EXTI" />
      <require Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="USART" />
    </condition>

  </conditions>
  
  <components>
    <!-- GD32F50x_StdPeripherals -->
    <component Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="ADC" Cversion="1.0.0" condition="GD32F50x STDPERIPHERALS RCU">
      <description>Analog-to-digital converter (ADC) driver for GD32F50x Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_ADC
      </RTE_Components_h>
      <files>
        <!-- ADC flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32f50x_adc.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32f50x_adc.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="BKP" Cversion="1.0.0" condition="GD32F50x STDPERIPHERALS RCU">
      <description>Backup registers (BKP) driver for GD32F50x Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_BKP
      </RTE_Components_h>
      <files>
        <!-- BKP flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32f50x_bkp.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32f50x_bkp.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="CAN" Cversion="1.0.0" condition="GD32F50x STDPERIPHERALS RCU">
      <description>Controller Area Network (CAN) driver for GD32F50x Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CAN
      </RTE_Components_h>
      <files>
        <!-- CAN flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32f50x_can.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32f50x_can.c" attr="config" version="1.0.0" />
      </files>
    </component>

