LJD12138/HS800/APP/.pack/GigaDevice/GD32F50x_DFP.1.0.1/GigaDevice.GD32F50x_DFP.pdsc
    <component Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="CRC" Cversion="1.0.0" condition="GD32F50x STDPERIPHERALS RCU">
      <description>Cyclic Redundancy Check (CRC) driver for GD32F50x Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CRC
      </RTE_Components_h>
      <files>
        <!-- CRC flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32f50x_crc.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32f50x_crc.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="CTC" Cversion="1.0.0" condition="GD32F50x STDPERIPHERALS RCU">
      <description>Clock trim controller (CTC) driver for GD32F50x Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CTC
      </RTE_Components_h>
      <files>
        <!-- CTC flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32f50x_ctc.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32f50x_ctc.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="CAU" Cversion="1.0.0" condition="GD32F50x STDPERIPHERALS RCU">
      <description>Cryptographic Acceleration Unit (CAU) driver for GD32F50x Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CAU
      </RTE_Components_h>
      <files>
        <!-- CAU flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32f50x_cau.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32f50x_cau.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="CMP" Cversion="1.0.0" condition="GD32F50x STDPERIPHERALS RCU">
      <description>Comparator (CMP) driver for GD32F50x Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_CMP
      </RTE_Components_h>
      <files>
        <!-- CMP flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32f50x_cmp.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32f50x_cmp.c" attr="config" version="1.0.0" />
      </files>
    </component>
	
    <component Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="HAU" Cversion="1.0.0" condition="GD32F50x STDPERIPHERALS RCU">
      <description>Hash Acceleration Unit (HAU) driver for GD32F50x Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_HAU
      </RTE_Components_h>
      <files>
        <!-- HAU flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32f50x_hau.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32f50x_hau.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="DAC" Cversion="1.0.0" condition="GD32F50x STDPERIPHERALS RCU">
      <description>Digital to analog converter (DAC) driver for GD32F50x Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DAC
      </RTE_Components_h>
      <files>
        <!-- DAC flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32f50x_dac.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32f50x_dac.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="DBG" Cversion="1.0.0" condition="GD32F50x STDPERIPHERALS RCU">
      <description>Debug (DBG) driver for GD32F50x Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DBG
      </RTE_Components_h>
      <files>
        <!-- DBG flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32f50x_dbg.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32f50x_dbg.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="DMA" Cversion="1.0.0" condition="GD32F50x STDPERIPHERALS RCU">
      <description>Direct Memory Access (DMA) driver for GD32F50x Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_DMA
      </RTE_Components_h>
      <files>
        <!-- DMA flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32f50x_dma.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32f50x_dma.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="EXMC" Cversion="1.0.0" condition="GD32F50x STDPERIPHERALS RCU">
      <description>External memory controller (EXMC) driver for GD32F50x Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXMC
      </RTE_Components_h>
      <files>
        <!-- EXMC flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32f50x_exmc.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32f50x_exmc.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="EXTI" Cversion="1.0.0" condition="GD32F50x STDPERIPHERALS RCU">
      <description>External Interrupt/Event (EXTI) driver for GD32F50x Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_EXTI
      </RTE_Components_h>
      <files>
        <!-- EXTI flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32f50x_exti.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32f50x_exti.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="FMC" Cversion="1.0.0" condition="GD32F50x STDPERIPHERALS RCU">
      <description>Flash Memory Controller (FMC) driver for GD32F50x Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FMC
      </RTE_Components_h>
      <files>
        <!-- FMC flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32f50x_fmc.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32f50x_fmc.c" attr="config" version="1.0.0" />
      </files>
    </component>

