LJD12138/HS800/APP/.pack/GigaDevice/GD32F50x_DFP.1.0.1/GigaDevice.GD32F50x_DFP.pdsc
    <component Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="FWDGT" Cversion="1.0.0" condition="GD32F50x STDPERIPHERALS RCU">
      <description>Free watchdog timer(FWDGT) driver for GD32F50x Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_FWDGT
      </RTE_Components_h>
      <files>
        <!-- FWDGT flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32f50x_fwdgt.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32f50x_fwdgt.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="GPIO" Cversion="1.0.0" condition="GD32F50x STDPERIPHERALS RCU">
      <description>General-purpose and Alternate-function I/Os (GPIO) driver for GD32F50x Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_GPIO
      </RTE_Components_h>
      <files>
        <!-- GPIO flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32f50x_gpio.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32f50x_gpio.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="I2C" Cversion="1.0.0" condition="GD32F50x STDPERIPHERALS RCU">
      <description>Inter-integrated Circuit (I2C) driver for GD32F50x Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_I2C
      </RTE_Components_h>
      <files>
        <!-- I2C flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32f50x_i2c.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32f50x_i2c.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="PMU" Cversion="1.0.0" condition="GD32F50x STDPERIPHERALS RCU">
      <description>Power Managment Unit(PMU) driver for GD32F50x Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_PMU
      </RTE_Components_h>
      <files>
        <!-- PMU flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32f50x_pmu.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32f50x_pmu.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="MISC" Cversion="1.0.0" condition="GD32F50x CMSIS">
      <description>MISC driver for GD32F50x Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_MISC
      </RTE_Components_h>
      <files>
        <!-- MISC flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32f50x_misc.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32f50x_misc.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="RCU" Cversion="1.0.0" condition="GD32F50x STDPERIPHERALS MISC">
      <description>Reset and Clock Control (RCU) driver for GD32F50x Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RCU
      </RTE_Components_h>
      <files>
        <!-- RCU flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32f50x_rcu.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32f50x_rcu.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="RTC" Cversion="1.0.0" condition="GD32F50x STDPERIPHERALS RCU">
      <description>Real-time Clock (RTC) driver for GD32F50x Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_RTC
      </RTE_Components_h>
      <files>
        <!-- RTC flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32f50x_rtc.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32f50x_rtc.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="SYSCFG" Cversion="1.0.0" condition="GD32F50x STDPERIPHERALS RCU">
      <description>SYSCFG driver for GD32F50x Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SYSCFG
      </RTE_Components_h>
      <files>
        <!-- SYSCFG flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32f50x_syscfg.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32f50x_syscfg.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="SPI_I2S" Cversion="1.0.0" condition="GD32F50x STDPERIPHERALS RCU">
      <description>Serial Peripheral Interface / Inter-IC Sound (SPI_I2S) driver for GD32F50x Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_SPI
      </RTE_Components_h>
      <files>
        <!-- SPI flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32f50x_spi.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32f50x_spi.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="TIMER" Cversion="1.0.0" condition="GD32F50x STDPERIPHERALS RCU">
      <description>TIMER driver for GD32F50x Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TIMER
    </RTE_Components_h>
      <files>
        <!-- TIMER flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32f50x_timer.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32f50x_timer.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="TRIGSEL" Cversion="1.0.0" condition="GD32F50x STDPERIPHERALS RCU">
      <description>Trigger selection controller (TRIGSEL) driver for GD32F50x Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TRIGSEL
    </RTE_Components_h>
      <files>
        <!-- TRIGSEL flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32f50x_trigsel.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32f50x_trigsel.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="TRNG" Cversion="1.0.0" condition="GD32F50x STDPERIPHERALS RCU">
      <description>True random number generator (TRNG) driver for GD32F50x Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_TRNG
    </RTE_Components_h>
      <files>
        <!-- TRNG flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32f50x_trng.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32f50x_trng.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <component Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="USART" Cversion="1.0.0" condition="GD32F50x STDPERIPHERALS RCU">
      <description>Universal Synchronous Asynchronous Receiver Transmitter (USART) driver for GD32F50x Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_USART
      </RTE_Components_h>
      <files>
        <!-- USART flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32f50x_usart.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32f50x_usart.c" attr="config" version="1.0.0" />
      </files>
    </component>

