LJD12138/HS800/APP/.pack/GigaDevice/GD32F50x_DFP.1.0.1/GigaDevice.GD32F50x_DFP.pdsc
    <component Cclass="Device" Cgroup="GD32F50x_StdPeripherals" Csub="WWDGT" Cversion="1.0.0" condition="GD32F50x STDPERIPHERALS RCU">
      <description>Window Watchdog Timer (WWDGT) driver for GD32F50x Devices</description>
      <RTE_Components_h>
        #define RTE_DEVICE_STDPERIPHERALS_WWDGT
      </RTE_Components_h>
      <files>
        <!-- WWDGT flie -->
        <file category="header" name="Device/Firmware/Peripherals/inc/gd32f50x_wwdgt.h" />
        <file category="source" name="Device/Firmware/Peripherals/src/gd32f50x_wwdgt.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <!-- Utilities GD32F50x -->
    <component Cclass="Device" Cgroup="EVAL" Csub="GD32F503" Cversion="1.0.0" condition="GD32F50x STDPERIPHERALS EVAL">
      <description>Firmware functions to manage Leds, Keys, COM ports</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Utilities/gd32f503v_eval.h" />
        <!-- eval file -->
        <file category="source" name="Device/Utilities/gd32f503v_eval.c" attr="config" version="1.0.0" />
      </files>
    </component>

    <!-- Config GD32F50x -->
    <component Cclass="Device" Cgroup="GD32F50x_libopt" Cversion="1.0.0" condition="GD32F50x CMSIS">
      <description>Configuration file</description>
      <files>
        <!-- include folder -->
        <file category="header" name="Device/Template/gd32f50x_libopt.h" />
      </files>
    </component>

    <!-- Startup GD32F50x -->
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="GD32F50x">
      <description>System Startup for GigaDevice GD32F50x High Density Devices</description>
      <files>
        <!-- include folder -->
        <file category="include" name="Device/Include/" />
        <file category="header" name="Device/Include/gd32f50x.h" />
        <!-- startup file -->
        <file category="source" name="Device/Source/ARM/startup_gd32f50x.s" attr="config" version="1.0.0" condition="Compiler ARMCC" />
        <!-- system file -->
        <file category="source" name="Device/Source/system_gd32f50x.c" attr="config" version="1.0.0" />
      </files>
    </component>
  </components>

</package>
